Ran Plan for dir: `live/dev/webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
- destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_instance.secondserver will be destroyed
- resource "aws_instance" "secondserver" {
      - ami                          = "ami-02e42a8490e212d0a" -> null
      - arn                          = "arn:aws:ec2:eu-west-2:565938106136:instance/i-08db573c1869c4568" -> null
      - associate_public_ip_address  = true -> null
      - availability_zone            = "eu-west-2a" -> null
      - cpu_core_count               = 1 -> null
      - cpu_threads_per_core         = 1 -> null
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - get_password_data            = false -> null
      - hibernation                  = false -> null
      - id                           = "i-08db573c1869c4568" -> null
      - instance_state               = "running" -> null
      - instance_type                = "t2.micro" -> null
      - ipv6_address_count           = 0 -> null
      - ipv6_addresses               = [] -> null
      - monitoring                   = false -> null
      - primary_network_interface_id = "eni-0f43c8fb9ede21d14" -> null
      - private_dns                  = "ip-172-31-21-220.eu-west-2.compute.internal" -> null
      - private_ip                   = "172.31.21.220" -> null
      - public_dns                   = "ec2-3-10-198-132.eu-west-2.compute.amazonaws.com" -> null
      - public_ip                    = "3.10.198.132" -> null
      - security_groups              = [
          - "default",
        ] -> null
      - source_dest_check            = true -> null
      - subnet_id                    = "subnet-7fc85c05" -> null
      - tags                         = {
          - "Name" = "updated by atlantis"
        } -> null
      - tenancy                      = "default" -> null
      - volume_tags                  = {} -> null
      - vpc_security_group_ids       = [
          - "sg-21842643",
        ] -> null

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - volume_id             = "vol-00bf6212af3ffc161" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.asg.aws_autoscaling_group.this will be updated in-place
~ resource "aws_autoscaling_group" "this" {
        arn                       = "arn:aws:autoscaling:eu-west-2:565938106136:autoScalingGroup:b2f7f047-40c1-4d28-9b66-0a65435bb168:autoScalingGroupName/tf-asg-20200520122237302200000002"
        availability_zones        = [
            "eu-west-2a",
            "eu-west-2b",
            "eu-west-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
        id                        = "tf-asg-20200520122237302200000002"
      ~ launch_configuration      = "terraform-20200520122236656200000001" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 3
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "tf-asg-20200520122237302200000002"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::565938106136:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:eu-west-2:565938106136:targetgroup/tf-atlantis-atlantis/27e4d82480057e91",
        ]
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-273ae16b",
            "subnet-7fc85c05",
            "subnet-d5367ebc",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "tf-atlantis"
        }
    }

  # module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-west-2:565938106136:launchConfiguration:d5729dad-9628-42f1-bcfb-d39362e7403a:launchConfigurationName/terraform-20200520122236656200000001" -> (known after apply)
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
        iam_instance_profile             = "ora2postgres_atlantis"
      ~ id                               = "terraform-20200520122236656200000001" -> (known after apply)
        image_id                         = "ami-01a6e31ac994bbc09"
        instance_type                    = "t2.micro"
        key_name                         = "atlantis"
      ~ name                             = "terraform-20200520122236656200000001" -> (known after apply)
        security_groups                  = [
            "sg-021e2ade202d68314",
        ]
      ~ user_data                        = "b26c91fe8526d740b60ecea7112142f39b7e34ee" -> "22823af49ddff5979fa7e91f37faa5ac87cbf2be" # forces replacement
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://tf-atlantis-alb-1287679549.eu-west-2.elb.amazonaws.com/events/lock?id=aws-freetier%252Ftf-aws-rnbv-complex%252Flive%252Fdev%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
